blueprints/infosat/sap/request_xml/sap_invoices_customer_by_date.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
   xmlns:glob="http://sap.com/xi/SAPGlobal20/Global">
   <soapenv:Header/>
   <soapenv:Body>
      <glob:CustomerInvoiceByElementsQuery_sync>
         <CustomerInvoiceSelectionByElements>
            <SelectionByDate>
               <!--Optional:-->
               <InclusionExclusionCode>I</InclusionExclusionCode>
               <!--Optional:-->
               <IntervalBoundaryTypeCode>3</IntervalBoundaryTypeCode>
               <!--Optional:-->
               <LowerBoundaryCustomerInvoiceDate>{{startdate}}</LowerBoundaryCustomerInvoiceDate>
               <!--Optional:-->
               <UpperBoundaryCustomerInvoiceDate>{{enddate}}</UpperBoundaryCustomerInvoiceDate>
            </SelectionByDate>

         </CustomerInvoiceSelectionByElements>

         <ProcessingConditions>
            <!--Optional:-->
            <QueryHitsMaximumNumberValue>10000</QueryHitsMaximumNumberValue>
            <QueryHitsUnlimitedIndicator>false</QueryHitsUnlimitedIndicator>
            <!--Optional:-->
            <LastReturnedObjectID schemeID="?" schemeVersionID="?" schemeAgencyID="?" schemeAgencySchemeID="?" schemeAgencySchemeAgencyID="?">?</LastReturnedObjectID>
         </ProcessingConditions>
         
      </glob:CustomerInvoiceByElementsQuery_sync>
   </soapenv:Body>
</soapenv:Envelope>